mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
static inline bool active_scanning(void)
{
    return (m_scanner.config.scan_type == 1);
}

/*****************************************************************************
* Radio operation
*****************************************************************************/

/**
 * Assume that there is no pending packet in p_buffer_packet. Then retrieve a slot for a packet from the 
 * packet_buffer and set the local p_buffer_packet to that slot. If there is no slot available in the packet buffer
 * the waiting_for_memory flag will be high. If there is a slot available (got_packet should be called got_slot)
 * retrieve the scanner_packet_t pointer from the larger p_buffer_packet struct. Write this pointer to 
 * NRF_RADIO->PACKETPTR to be subsequently be filled by the radio when it goes in RX mode.
 */
static bool radio_set_packet(void)
{
    NRF_MESH_ASSERT(m_scanner.p_buffer_packet == NULL);

    bool got_packet = (NRF_SUCCESS == packet_buffer_reserve(&m_scanner.packet_buffer,
                                                            &m_scanner.p_buffer_packet,
                                                            sizeof(scanner_packet_t)));
    if (got_packet)
    {
        scanner_packet_t * p_packet = (scanner_packet_t *) m_scanner.p_buffer_packet->packet;
        NRF_RADIO->PACKETPTR = (uint32_t) &p_packet->packet;
    }
    else
    {
        m_scanner.stats.out_of_memory++;
    }

    m_scanner.waiting_for_memory = !got_packet;
    return got_packet;
}

/*
 * Configure radio. Add short between READY and START and between receiving the ADDRESS and starting RSSI.
 */
static void radio_configure(void)
{
    radio_config_reset();
    radio_config_config(&m_scanner.config.radio_config);

    NRF_RADIO->RXADDRESSES = 0;
    for (uint32_t i = 0; i < RADIO_CONFIG_LOGICAL_ADDRS; i++)
    {
        if (m_scanner.config.access_addresses[i] != SCANNER_ACCESS_ADDR_INVALID)
        {
            radio_config_access_addr_set(m_scanner.config.access_addresses[i], i);
            NRF_RADIO->RXADDRESSES |= (1UL << i);
        }
    }

    NRF_RADIO->INTENSET = RADIO_INTENSET_END_Msk;
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk;
    NRF_RADIO->EVENTS_ADDRESS = 0;

    /* Set up timestamp capture */
    NRF_PPI->CH[SCANNER_PPI_CH].EEP = (uint32_t) &NRF_RADIO->EVENTS_ADDRESS;
    NRF_PPI->CH[SCANNER_PPI_CH].TEP = (uint32_t) &NRF_TIMER0->TASKS_CAPTURE[SCANNER_TIMER_INDEX_TIMESTAMP];
    NRF_PPI->CHENSET = (1UL << SCANNER_PPI_CH);
}

/**
 * Switch to higher priority interrupt context by triggering radio interrupt.
 */
static inline void radio_trigger(void)
{
    uint32_t was_masked;
    _DISABLE_IRQS(was_masked);
    if (m_scanner.has_radio_context)
    {
        (void) NVIC_SetPendingIRQ(RADIO_IRQn);
    }
    _ENABLE_IRQS(was_masked);
}

static void radio_stop(void)
{
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_RADIO_IN_RX);
    NRF_RADIO->TASKS_DISABLE = 1;
    /* clear any end events, to avoid a misfire */
    NRF_RADIO->EVENTS_END = 0;
    if (m_scanner.p_buffer_packet != NULL)
    {
        packet_buffer_free(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);
        m_scanner.p_buffer_packet = NULL;
    }
#if !defined(HOST)
    while (NRF_RADIO->STATE != RADIO_STATE_STATE_Disabled);
#endif
    mesh_pa_lna_cleanup();
}

/**
 * First configure the radio if necessary.
 * Then, if there is space, set pointers to the right (empty buffer) and set RADIO to RX.
 * Subsequently, we have to wait till an END event, see the function radio_handle_end_event
 *
 * It is important that the radio is in a DISABLED state. If not, an assertion will be raised. Make sure the radio
 * has been sent an DISABLE event either explicitly or via an END_DISABLE short.
 */
static void radio_start(void)
{
    NRF_MESH_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled);

    radio_config_channel_set(m_scanner.config.channels[m_scanner.channel_index]);
    if (m_scanner.is_radio_cfg_pending)
    {
        radio_configure();
        m_scanner.is_radio_cfg_pending = false;
    }
    if (radio_set_packet())
    {
        BEARER_ACTION_TIMER->TASKS_CAPTURE[SCANNER_TIMER_INDEX_LNA_SETUP] = 1;
        NRF_RADIO->TASKS_RXEN = 1;

        mesh_lna_setup_start(BEARER_ACTION_TIMER->CC[SCANNER_TIMER_INDEX_LNA_SETUP] + LNA_SETUP_OVERHEAD_US,
                             SCANNER_TIMER_INDEX_LNA_SETUP);
        mesh_pa_lna_setup_stop();

        BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP] = 0;
        NVIC_ClearPendingIRQ(BEARER_ACTION_TIMER_IRQn);
        BEARER_ACTION_TIMER->INTENSET = SCANNER_TIMER_LNA_INTERRUPT_Msk;

        DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_RADIO_IN_RX);
    }
    m_scanner.window_state = SCAN_WINDOW_STATE_ON;
}

/**
 * Send a scan request after we have received a scannable packet. We are then in SCANNER_STATE_RUNNING mode. If not,
 * it would be an error to actually end up here. The recently received packet has been written by the radio 
 * peripheral to p_packet (argument to this function). 
 *
 * We do not want to have the radio going to start receiving stuff for a second. This means all calls to 
 * radio_set_packet have to be ignored. This is not enough. Also calls to radio_start have to be ignored. For
 * starters radio_start assumes a DISABLED radio. It configures
 *
 * TODO: Check if this interferes with the RX process. If the RX process overwrites so now and then a scan request
 * this is not a problem. As long as the radio state is correct and there are no NRF_MESH_ASSERTs going off.
 */
static void radio_send_scan_request(const scanner_packet_t * p_packet) {
    // only return a scan request when actually scanning
    if (m_scanner.state != SCANNER_STATE_RUNNING) {
        __LOG(LOG_SRC_NETWORK, LOG_LEVEL_DBG1, "send_scan_req: %i\n", m_scanner.state);
        // assert
        return;
    }
    // copy address of advertiser to tx buffer 
    memcpy(&m_tx_buf[9], p_packet->packet.addr, BLE_GAP_ADDR_LEN);
   
    /*
    __LOG(LOG_SRC_NETWORK,
        LOG_LEVEL_DBG1,
        "SCAN_REQ %x:%x:%x:%x\n",
        m_tx_buf[9],
        m_tx_buf[10],
        m_tx_buf[11],
        m_tx_buf[12]);
    */

