mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
    NRF_RADIO->PACKETPTR = (uint32_t) &m_tx_buf[0];

    // Clear DISABLED event
    NRF_RADIO->EVENTS_DISABLED = 0;
    NRF_RADIO->EVENTS_END = 0;
    
    // Make sure SHORTS are same as in RX
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk;

    // should subsequently get a REDY event and then a START task need to be set
    NRF_RADIO->TASKS_TXEN = 1;
    
    m_scanner.state = SCANNER_STATE_SEND_REQ;
}

/**
 * Best indeed is to just set to RX and not have to cycle through radio_stop() and radio_start().
 *
 * If we set this back to SCANNER_STATE_RUNNING, we 
 *
 * TODO: Check if this is working smoothly across all conditions.
 */
static void radio_handle_tx_end_event(void)
{
    if (m_scanner.state != SCANNER_STATE_SEND_REQ) {
        __LOG(LOG_SRC_NETWORK, LOG_LEVEL_DBG1, "tx_end_event: %i\n", m_scanner.state);
        // assert 
        return;
    }
    /*
    __LOG(LOG_SRC_NETWORK,
        LOG_LEVEL_DBG1,
        "SCAN_REQ END %x:%x:%x:%x\n",
        m_tx_buf[9],
        m_tx_buf[10],
        m_tx_buf[11],
        m_tx_buf[12]);
    */

    radio_stop();
    radio_start();

    NRF_RADIO->TASKS_RXEN = 1;

    m_scanner.state = SCANNER_STATE_RUNNING;
}

/**
 * A packet has been successfully received and can now be found in the m_scanner.p_buffer_packet->packet.
 */
static void radio_handle_rx_end_event(void)
{
    if (m_scanner.state == SCANNER_STATE_SEND_REQ) {
        // assert
        return;
    }

    bool successful_receive = false;
    scanner_packet_t * p_packet = (scanner_packet_t *) m_scanner.p_buffer_packet->packet;

    if (!NRF_RADIO->CRCSTATUS)
    {
        m_scanner.stats.crc_failures++;
    }
    else if (p_packet->packet.header.length > m_scanner.config.radio_config.payload_maxlen)
    {
        m_scanner.stats.length_out_of_bounds++;
    }
    else
    {
        successful_receive = true;
    }

    if (successful_receive)
    {
        p_packet->metadata.rssi = - ((int32_t) NRF_RADIO->RSSISAMPLE);
        p_packet->metadata.access_addr = m_scanner.config.access_addresses[NRF_RADIO->RXMATCH];
        /* The 6 lowest bit of the datawhite IV is the same as the channel number in BLE: */
        p_packet->metadata.channel = NRF_RADIO->DATAWHITEIV & 0x3F;
        ts_timestamp_t rx_timestamp_ts = NRF_TIMER0->CC[SCANNER_TIMER_INDEX_TIMESTAMP];
        p_packet->metadata.timestamp = ts_timer_to_device_time(rx_timestamp_ts);

        memcpy(p_packet->metadata.adv_addr.addr, p_packet->packet.addr, BLE_GAP_ADDR_LEN);
        p_packet->metadata.adv_addr.addr_type = p_packet->packet.header.addr_type;
        p_packet->metadata.adv_type = p_packet->packet.header.type;

        m_scanner.stats.successful_receives++;

        if (m_scanner.rx_callback != NULL)
        {
            m_scanner.rx_callback(p_packet, rx_timestamp_ts);
        }

        if (m_scanner.p_buffer_packet == NULL) {
          __LOG(LOG_SRC_NETWORK, LOG_LEVEL_DBG1, "Error?\n");;
        } else {
        packet_buffer_commit(&m_scanner.packet_buffer,
                             m_scanner.p_buffer_packet,
                             SCANNER_PACKET_OVERHEAD + p_packet->packet.header.length);
        }
        if (active_scanning() && (p_packet->packet.header.type == BLE_PACKET_TYPE_ADV_DISCOVER_IND)) {
          // we still want to commit previously obtained packet to buffer
            radio_send_scan_request(p_packet);
        }

        bearer_event_flag_set(m_scanner.nrf_mesh_process_flag);
    }
    else
    {
        if (m_scanner.p_buffer_packet == NULL) {
          __LOG(LOG_SRC_NETWORK, LOG_LEVEL_DBG1, "Error 1?\n");;
        } else {
          packet_buffer_free(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);
        }
    }

    m_scanner.p_buffer_packet = NULL;

    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_END_EVENT);
}

static void radio_handle_end_event(void)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_END_EVENT);

    if (m_scanner.state == SCANNER_STATE_SEND_REQ) {
      radio_handle_tx_end_event();
    } else {
      radio_handle_rx_end_event();
    }
}

/**
 * Radio disabled event (will be send by the radio peripheral if the radio is actually disabled). When there is a 
 * short between END and DISABLE, there is no need to send an actual DISABLE event to the radio.
 * In the case of the scanner the RADIO_SHORTS_END_DISABLE_Msk short is not set, and the radio will not get disabled
 * after each END event. This means START will be called after an END event.
 */
static void radio_state_disabled_handle(void)
{
    switch (m_scanner.window_state)
    {
        case SCAN_WINDOW_STATE_NEXT_CHANNEL:
        case SCAN_WINDOW_STATE_ON:
            radio_start();
            break;
        case SCAN_WINDOW_STATE_OFF:
            // Do nothing
            break;
        default:
            NRF_MESH_ASSERT(false);
    }
}

/**
 * The difference between the rx_handle and the rxidle_handle is that ONLY in the RXIDLE state there will be a
 * TASKS_START event generated.
 *
 * TODO: Note, should never end up here... There is a short between READY and START. Nop, does not end up here.
 */
static void radio_state_rxidle_handle(void)
{
    switch (m_scanner.window_state)
    {
        case SCAN_WINDOW_STATE_NEXT_CHANNEL:
            /* Go to disabled state to change channels */
            radio_stop();
            radio_start();
            break;
        case SCAN_WINDOW_STATE_ON:
            if (m_scanner.state == SCANNER_STATE_SEND_REQ) 
            {
                NRF_RADIO->TASKS_START = 1;
                DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_RADIO_IN_TX);
            }
            else 
            {
              if (radio_set_packet())
              {
                NRF_RADIO->TASKS_START = 1;
                DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_RADIO_IN_RX);
              }
            }
            break;
        case SCAN_WINDOW_STATE_OFF:
            radio_stop();
            break;
        default:
            NRF_MESH_ASSERT(false);
    }
}

