mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
static void radio_state_txidle_handle(void)
{
    radio_state_rxidle_handle();
}

static void radio_state_rx_handle(void)
{
    switch (m_scanner.window_state)
    {
        case SCAN_WINDOW_STATE_NEXT_CHANNEL:
            /* Go to disabled state to change channels */
            radio_stop();
            radio_start();
            break;
        case SCAN_WINDOW_STATE_ON:
            // Do nothing
            break;
        case SCAN_WINDOW_STATE_OFF:
            radio_stop();
            break;
        default:
            NRF_MESH_ASSERT(false);
    }
}

/**
 * One of the last things it does. Somehow it does not do anything afterwards. Weirdly enough, there was no 
 * tx idle call. There were only direct rxidle calls. Every time RX has been started.
 */
static void radio_state_tx_handle(void)
{
    radio_state_rx_handle();
}

/**
 * Small finite state machine (combined with the called functions). 
 */
static void radio_setup_next_operation(void)
{
    switch (m_scanner.state)
    {
        case SCANNER_STATE_IDLE:
            radio_stop();
            break;

        case SCANNER_STATE_SEND_REQ:
        case SCANNER_STATE_RUNNING:
            switch (NRF_RADIO->STATE)
            {
                case RADIO_STATE_STATE_Disabled:
                    radio_state_disabled_handle();
                    break;
                case RADIO_STATE_STATE_TxIdle:
                    radio_state_txidle_handle(); 
                    break;
                case RADIO_STATE_STATE_Tx:
                case RADIO_STATE_STATE_TxRu:
                    radio_state_tx_handle(); 
                    break;
                case RADIO_STATE_STATE_TxDisable:
                    break;
                case RADIO_STATE_STATE_RxIdle:
                    radio_state_rxidle_handle();
                    break;
                case RADIO_STATE_STATE_Rx:
                case RADIO_STATE_STATE_RxRu:
                    radio_state_rx_handle();
                    break;
                case RADIO_STATE_STATE_RxDisable:
                default:
                    NRF_MESH_ASSERT(false);
            }
            break;

        case SCANNER_STATE_UNINITIALIZED:
        default:
            NRF_MESH_ASSERT(false);
    }
}

/*****************************************************************************
* Bearer handler callback functions
*****************************************************************************/

void scanner_radio_start(ts_timestamp_t start_time)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_START);
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_IN_ACTION);
    m_scanner.has_radio_context = true;
    m_scanner.is_radio_cfg_pending = false;
    radio_configure();

    if ((m_scanner.state == SCANNER_STATE_RUNNING || m_scanner.state == SCANNER_STATE_SEND_REQ) &&
        m_scanner.window_state != SCAN_WINDOW_STATE_OFF)
    {
        radio_start();
    }
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_START);
}

void scanner_radio_stop(void)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_STOP);
    m_scanner.has_radio_context = false;
    radio_stop();
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_IN_ACTION);
    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_STOP);
}

void scanner_radio_irq_handler(void)
{
    DEBUG_PIN_SCANNER_ON(DEBUG_PIN_SCANNER_RADIO_IRQ);
    if (NRF_RADIO->EVENTS_END)
    {
        DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_RADIO_IN_RX);
        DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_RADIO_IN_TX);
        NRF_RADIO->EVENTS_END = 0;
        (void) NRF_RADIO->EVENTS_END;
        radio_handle_end_event();
    }

    radio_setup_next_operation();

    DEBUG_PIN_SCANNER_OFF(DEBUG_PIN_SCANNER_RADIO_IRQ);
}

void scanner_timer_irq_handler(void)
{
    /* As soon as the LNA timer fires, we prepare for the stop to avoid getting hit by rollover. */
    NRF_MESH_ASSERT(BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP]);
    BEARER_ACTION_TIMER->INTENCLR = SCANNER_TIMER_LNA_INTERRUPT_Msk;
    BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP] = 0;
    (void) BEARER_ACTION_TIMER->EVENTS_COMPARE[SCANNER_TIMER_INDEX_LNA_SETUP];

    mesh_pa_lna_disable_start();
}
/*****************************************************************************
* Timer handling
*****************************************************************************/

static void scan_window_end(uint32_t timestamp, void * p_context)
{
    m_scanner.window_state = SCAN_WINDOW_STATE_OFF;
    radio_trigger();
}

static void scan_window_start(uint32_t timestamp, void * p_context)
{
    channel_iterate();
    radio_trigger();
}

static void schedule_timers(void)
{
    uint32_t time_now = timer_now();

    if (continuous_scanning())
    {
        timer_sch_abort(&m_scanner.timer_window_end);
    }
    else
    {
        timer_sch_reschedule(&m_scanner.timer_window_end, time_now + m_scanner.config.scan_window_us);
    }

    timer_sch_reschedule(&m_scanner.timer_window_start, time_now);
}

/*****************************************************************************
* Interface functions
*****************************************************************************/

void scanner_init(bearer_event_flag_callback_t packet_process_cb)
{
    memset(&m_scanner, 0, sizeof(m_scanner));

    packet_buffer_init(&m_scanner.packet_buffer, m_scanner.packet_buffer_data, SCANNER_BUFFER_SIZE);
    scanner_config_reset();
    m_scanner.config.radio_config.tx_power = RADIO_POWER_NRF_0DBM;
    m_scanner.config.radio_config.payload_maxlen = RADIO_CONFIG_ADV_MAX_PAYLOAD_SIZE;
    m_scanner.config.scan_type = SCANNER_ACTIVE;
    m_scanner.timer_window_end.cb = scan_window_end;
    m_scanner.timer_window_start.cb = scan_window_start;
    m_scanner.state = SCANNER_STATE_IDLE;
    m_scanner.window_state = SCAN_WINDOW_STATE_ON;
    m_scanner.nrf_mesh_process_flag = bearer_event_flag_add(packet_process_cb);
}

void scanner_rx_callback_set(scanner_rx_callback_t callback)
{
    if (m_scanner.rx_callback)
    {
        /* Make sure we don't overwrite an active callback */
        NRF_MESH_ASSERT(callback == NULL);
    }
    m_scanner.rx_callback = callback;
}

void scanner_enable(void)
{
    NRF_MESH_ASSERT(m_scanner.state != SCANNER_STATE_UNINITIALIZED);

