mrquincle/nRF5-SDK-for-Mesh/mesh/bearer/src/scanner.c
    if (m_scanner.state == SCANNER_STATE_IDLE)
    {
        schedule_timers();
        m_scanner.state = SCANNER_STATE_RUNNING;
        bearer_handler_wake_up();
    }
}

void scanner_disable(void)
{
    NRF_MESH_ASSERT(m_scanner.state != SCANNER_STATE_UNINITIALIZED);

    if (m_scanner.state == SCANNER_STATE_RUNNING || m_scanner.state == SCANNER_STATE_SEND_REQ)
    {
        timer_sch_abort(&m_scanner.timer_window_end);
        timer_sch_abort(&m_scanner.timer_window_start);
        m_scanner.state = SCANNER_STATE_IDLE;
        radio_trigger();
    }
}

bool scanner_is_enabled(void)
{
    return (m_scanner.state == SCANNER_STATE_RUNNING || m_scanner.state == SCANNER_STATE_SEND_REQ);
}

const scanner_packet_t * scanner_rx(void)
{
    packet_buffer_packet_t * p_packet;

    while (packet_buffer_pop(&m_scanner.packet_buffer, &p_packet) == NRF_SUCCESS)
    {
        if (fen_filters_apply((scanner_packet_t *)p_packet->packet))
        {
            scanner_packet_release((scanner_packet_t *)p_packet->packet);
        }
        else
        {
            return (scanner_packet_t *)p_packet->packet;
        }
    }

    return NULL;
}

void scanner_packet_release(const scanner_packet_t * p_packet)
{
    NRF_MESH_ASSERT(p_packet != NULL);
    packet_buffer_free(&m_scanner.packet_buffer,
                       PARENT_BY_FIELD_GET(packet_buffer_packet_t, packet, p_packet));
    if (m_scanner.waiting_for_memory)
    {
        radio_trigger();
    }
}

const scanner_stats_t * scanner_stats_get(void)
{
    return &m_scanner.stats;
}

bool scanner_rx_pending(void)
{
    return packet_buffer_can_pop(&m_scanner.packet_buffer);
}

/*****************************************************************************
* Configuration interface functions
*****************************************************************************/

void scanner_config_radio_mode_set(radio_mode_t radio_mode)
{
    m_scanner.config.radio_config.radio_mode = radio_mode;
    m_scanner.is_radio_cfg_pending = true;
}

void scanner_config_scan_time_set(uint32_t scan_interval_us, uint32_t scan_window_us)
{
    NRF_MESH_ASSERT(scan_interval_us >= scan_window_us);
    NRF_MESH_ASSERT(scan_interval_us <= MS_TO_US(BEARER_SCAN_INT_MAX_MS));
    NRF_MESH_ASSERT(scan_window_us >= MS_TO_US(BEARER_SCAN_WIN_MIN_MS));
    m_scanner.config.scan_interval_us = scan_interval_us;
    m_scanner.config.scan_window_us = scan_window_us;
    m_scanner.timer_window_end.interval = m_scanner.config.scan_interval_us;
    m_scanner.timer_window_start.interval = m_scanner.config.scan_interval_us;
    if (m_scanner.state == SCANNER_STATE_RUNNING || m_scanner.state == SCANNER_STATE_SEND_REQ)
    {
        schedule_timers();
    }
}

static bool channels_are_valid(const uint8_t * p_channels, uint8_t channel_count)
{
    uint8_t valid_channels[] = SCANNER_CHANNELS_DEFAULT;

    for (uint8_t i = 0; i < channel_count; i++)
    {
        bool found = false;
        for (uint8_t j = 0; j < sizeof(valid_channels); j++)
        {
            if (p_channels[i] == valid_channels[j])
            {
                found = true;
                break;
            }
        }
        if (!found)
        {
            return false;
        }
    }
    return true;
}

void scanner_config_channels_set(const uint8_t * p_channels, uint8_t channel_count)
{
    NRF_MESH_ASSERT(channel_count > 0 && channel_count <= SCANNER_CHANNELS_MAX);
    NRF_MESH_ASSERT(channels_are_valid(p_channels, channel_count));
    memcpy(m_scanner.config.channels, p_channels, channel_count);
    m_scanner.channel_index = 0;
    m_scanner.config.channel_count = channel_count;
}

/* The memset() in scanner_config_access_addresses_set() will not have the expected effect
   unless SCANNER_ACCESS_ADDR_INVALID is zero. */
NRF_MESH_STATIC_ASSERT(SCANNER_ACCESS_ADDR_INVALID == 0);

void scanner_config_access_addresses_set(const uint32_t * p_access_addresses, uint8_t address_count)
{
    NRF_MESH_ASSERT(address_count > 0 && address_count <= RADIO_CONFIG_LOGICAL_ADDRS);
    memset(&m_scanner.config.access_addresses[0], 0, sizeof(m_scanner.config.access_addresses));
    memcpy(&m_scanner.config.access_addresses[0], p_access_addresses, sizeof(uint32_t) * address_count);

    m_scanner.is_radio_cfg_pending = true;
}

void scanner_config_reset(void)
{
    uint8_t channels[] = SCANNER_CHANNELS_DEFAULT;
    scanner_config_channels_set(channels, sizeof(channels));

    uint32_t access_address = BEARER_ACCESS_ADDR_DEFAULT;
    scanner_config_access_addresses_set(&access_address, 1);

    scanner_config_radio_mode_set(RADIO_MODE_BLE_1MBIT);
    scanner_config_scan_time_set(MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS), MS_TO_US(BEARER_SCAN_WINDOW_DEFAULT_MS));
}
